app/Controllers/Barang.php

SELECT *
FROM `kategori`
ORDER BY `nama_kategori` ASC
SELECT *
FROM `satuan`
ORDER BY `nama_satuan` ASC
---
    public function index()
    {
        $data = [
            'title'    => 'Master Data Barang - POS System',
            'barang'   => $this->barangModel->getBarangWithRelations(),
            'kategori' => $this->kategoriModel->orderBy('nama_kategori', 'ASC')->findAll(),
            'satuan'   => $this->satuanModel->orderBy('nama_satuan', 'ASC')->findAll(),