app/Controllers/Dashboard.php

    public function index()
    {
        $sessionData = [
            'user_id'     => session()->get('user_id'),
            'username'    => session()->get('username'),
            'nama_user'   => session()->get('nama_user'),
            'role'        => session()->get('role'),
            'id_supplier' => session()->get('id_supplier'),
        ];

        $supplierName = null;
        if (! empty($sessionData['id_supplier'])) {
            $sup = $this->db->table('supplier')
                ->where('id_supplier', $sessionData['id_supplier'])
                ->get()
                ->getRowArray();
            if ($sup) {
                $supplierName = $sup['nama_supplier'];
            }
        }

        // 1. Total Omzet Bersih (Penjualan Selesai dikurangi Retur Customer Approved)
        $omzetRow = $this->db->table('penjualan')
            ->selectSum('total_belanja', 'total')
            ->where('status', 'selesai')
            ->get()
            ->getRowArray();
        $grossOmzet = (float) ($omzetRow['total'] ?? 0);

        $returRow = $this->db->table('retur')
            ->selectSum('total_refund', 'total')
            ->where('status', 'approved')
            ->get()
            ->getRowArray();
---
SELECT SUM(`total_belanja`) AS `total`
FROM `penjualan`
WHERE `status` = 'selesai'
SELECT SUM(`total_refund`) AS `total`
FROM `retur`
WHERE `status` = 'approved'

        $totalOmzet = max(0, $grossOmzet - $totalRefundApproved);

        // 2. Total Barang (Jumlah Barang Aktif)
        $totalBarang = $this->db->table('barang')
            ->where('aktif', 1)
            ->countAllResults();

        // 3. Total Kategori
        $totalKategori = $this->db->table('kategori')->countAllResults();

        // 4. Total Customer
        $totalCustomer = $this->db->table('customer')->countAllResults();

        // 5. NOTIFIKASI BARANG HABIS / STOK MENIPIS (stok <= stok_minimum)
        $barangHabisCount = $this->db->table('barang')
            ->where('stok <= stok_minimum')
            ->where('aktif', 1)
            ->countAllResults();

        $barangHabisList = $this->db->table('barang')
            ->select('id_barang, nama_barang, stok, stok_minimum, harga_jual')
            ->where('stok <= stok_minimum')
            ->where('aktif', 1)
            ->orderBy('stok', 'ASC')
            ->get(5)
            ->getResultArray();

        // 6. Distribution of Barang by Kategori
        $catDist = $this->db->table('barang b')
            ->select('k.nama_kategori, COUNT(b.id_barang) as total_item')
            ->join('kategori k', 'k.id_kategori = b.id_kategori')
            ->groupBy('k.id_kategori, k.nama_kategori')
            ->get()
            ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `barang`
WHERE `aktif` = 1
SELECT COUNT(*) AS `numrows`
FROM `kategori`
SELECT COUNT(*) AS `numrows`
FROM `customer`
SELECT COUNT(*) AS `numrows`
FROM `barang`
WHERE `stok` <= stok_minimum
AND `aktif` = 1
SELECT `id_barang`, `nama_barang`, `stok`, `stok_minimum`, `harga_jual`
FROM `barang`
WHERE `stok` <= stok_minimum
AND `aktif` = 1
ORDER BY `stok` ASC
 LIMIT 5
SELECT `k`.`nama_kategori`, COUNT(b.id_barang) as total_item
FROM `barang` `b`
JOIN `kategori` `k` ON `k`.`id_kategori` = `b`.`id_kategori`
GROUP BY `k`.`id_kategori`, `k`.`nama_kategori`