app/Controllers/MasterUsers.php

    public function index()
    {
        return view('master_users/index', [
            'title'     => 'Master Data Users - POS System',
            'users'     => $this->userModel->getUsersWithSupplier(),
            'suppliers' => $this->supplierModel->where('aktif', 1)->orderBy('nama_supplier', 'ASC')->findAll(),
---
SELECT *
FROM `supplier`
WHERE `aktif` = 1
ORDER BY `nama_supplier` ASC