app/Controllers/Penjualan.php

    public function getBarang()
    {
        $keyword = $this->request->getGet('q');

        $builder = $this->db->table('barang b')
            ->select('b.id_barang, b.barcode, b.nama_barang, b.harga_jual, b.stok, s.nama_satuan')
            ->join('satuan s', 's.id_satuan = b.id_satuan')
            ->where('b.aktif', 1)
            ->where('b.stok >', 0);

        if ($keyword) {
            $builder->groupStart()
                ->like('b.nama_barang', $keyword)
                ->orLike('b.barcode', $keyword)
                ->groupEnd();
        }

        $barang = $builder->orderBy('b.nama_barang', 'ASC')->get()->getResultArray();
---
SELECT `b`.`id_barang`, `b`.`barcode`, `b`.`nama_barang`, `b`.`harga_jual`, `b`.`stok`, `s`.`nama_satuan`
FROM `barang` `b`
JOIN `satuan` `s` ON `s`.`id_satuan` = `b`.`id_satuan`
WHERE `b`.`aktif` = 1
AND `b`.`stok` > 0
ORDER BY `b`.`nama_barang` ASC