app/Models/BarangModel.php

    public function generateId(): string
    {
        $lastRow = $this->select('id_barang')
            ->orderBy('id_barang', 'DESC')
            ->first();
---
SELECT `id_barang`
FROM `barang`
ORDER BY `id_barang` DESC
 LIMIT 1

    public function getBarangWithRelations(?string $id = null): array
    {
        $builder = $this->db->table('barang b')
            ->select('b.*, k.nama_kategori, s.nama_satuan, u.nama_user as pembuat')
            ->join('kategori k', 'k.id_kategori = b.id_kategori')
            ->join('satuan s', 's.id_satuan = b.id_satuan')
            ->join('users u', 'u.user_id = b.created_by', 'left');

        if ($id !== null) {
            return $builder->where('b.id_barang', $id)->get()->getRowArray() ?? [];
        }

        return $builder->orderBy('b.created_at', 'DESC')->get()->getResultArray();
---
SELECT `b`.*, `k`.`nama_kategori`, `s`.`nama_satuan`, `u`.`nama_user` as `pembuat`
FROM `barang` `b`
JOIN `kategori` `k` ON `k`.`id_kategori` = `b`.`id_kategori`
JOIN `satuan` `s` ON `s`.`id_satuan` = `b`.`id_satuan`
LEFT JOIN `users` `u` ON `u`.`user_id` = `b`.`created_by`
ORDER BY `b`.`created_at` DESC