app/Models/DetailPenjualanModel.php

SELECT `dp`.*, `b`.`nama_barang`, `b`.`barcode`, `s`.`nama_satuan`
FROM `detail_penjualan` `dp`
JOIN `barang` `b` ON `b`.`id_barang` = `dp`.`id_barang`
JOIN `satuan` `s` ON `s`.`id_satuan` = `b`.`id_satuan`
WHERE `dp`.`id_penjualan` = 'PJ202609200008'
---
    public function getByPenjualan(string $idPenjualan): array
    {
        return $this->db->table('detail_penjualan dp')
            ->select('dp.*, b.nama_barang, b.barcode, s.nama_satuan')
            ->join('barang b', 'b.id_barang = dp.id_barang')
            ->join('satuan s', 's.id_satuan = b.id_satuan')
            ->where('dp.id_penjualan', $idPenjualan)
            ->get()
            ->getResultArray();