app/Models/PenjualanModel.php

SELECT `p`.*, `u`.`nama_user` as `nama_kasir`, `c`.`nama_customer`
FROM `penjualan` `p`
JOIN `users` `u` ON `u`.`user_id` = `p`.`user_id`
LEFT JOIN `customer` `c` ON `c`.`id_customer` = `p`.`id_customer`
WHERE `p`.`id_penjualan` = 'PJ202609200008'
---
    public function getPenjualanWithRelations(?string $id = null): array
    {
        $builder = $this->db->table('penjualan p')
            ->select('p.*, u.nama_user as nama_kasir, c.nama_customer')
            ->join('users u', 'u.user_id = p.user_id')
            ->join('customer c', 'c.id_customer = p.id_customer', 'left');

        if ($id !== null) {
            return $builder->where('p.id_penjualan', $id)->get()->getRowArray() ?? [];