app/Models/RecoveryKeyModel.php

UPDATE `recovery_keys` SET `is_used` = 1, `used_at` = '2026-09-26 19:01:12'
WHERE `recovery_keys`.`id` IN (6)
---
    public function invalidate(int $id): void
    {
        $this->update($id, [
            "is_used" => 1,
            "used_at" => date("Y-m-d H:i:s"),
        ]);