app/Models/ReturModel.php

    public function getReturWithRelations(?string $id = null, ?string $statusFilter = null): array
    {
        $builder = $this->db->table('retur r')
            ->select('r.*, p.tanggal_jual, u_kasir.nama_user as nama_kasir, u_spv.nama_user as nama_spv')
            ->join('penjualan p', 'p.id_penjualan = r.id_penjualan')
            ->join('users u_kasir', 'u_kasir.user_id = r.user_id_kasir', 'left')
            ->join('users u_spv', 'u_spv.user_id = r.user_id_spv', 'left');

        if ($statusFilter !== null) {
            $builder->where('r.status', $statusFilter);
        }

        if ($id !== null) {
            return $builder->where('r.id_retur', $id)->get()->getRowArray() ?? [];
        }

        return $builder->orderBy('r.tanggal_retur', 'DESC')->get()->getResultArray();
---
SELECT `r`.*, `p`.`tanggal_jual`, `u_kasir`.`nama_user` as `nama_kasir`, `u_spv`.`nama_user` as `nama_spv`
FROM `retur` `r`
JOIN `penjualan` `p` ON `p`.`id_penjualan` = `r`.`id_penjualan`
LEFT JOIN `users` `u_kasir` ON `u_kasir`.`user_id` = `r`.`user_id_kasir`
LEFT JOIN `users` `u_spv` ON `u_spv`.`user_id` = `r`.`user_id_spv`
ORDER BY `r`.`tanggal_retur` DESC