app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'mochammadjiddanarmansyiah@gmail.com'
AND `aktif` = 1
 LIMIT 1
---
    public function getActiveUserByUsername(string $username): ?array
    {
        return $this->where('username', $username)
                    ->where('aktif', 1)
                    ->first();

SELECT `user_id`
FROM `users`
WHERE `user_id` LIKE 'usr%' ESCAPE '!'
ORDER BY `user_id` DESC
 LIMIT 1
---
    public function generateId(): string
    {
        $lastRow = $this->select('user_id')
            ->like('user_id', 'usr', 'after')
            ->orderBy('user_id', 'DESC')
            ->first();

SELECT `u`.*, `s`.`nama_supplier`
FROM `users` `u`
LEFT JOIN `supplier` `s` ON `s`.`id_supplier` = `u`.`id_supplier`
ORDER BY `u`.`created_at` DESC
---
    public function getUsersWithSupplier(?string $id = null): array
    {
        $builder = $this->db->table('users u')
            ->select('u.*, s.nama_supplier')
            ->join('supplier s', 's.id_supplier = u.id_supplier', 'left');

        if ($id !== null) {
            return $builder->where('u.user_id', $id)->get()->getRowArray() ?? [];
        }

        return $builder->orderBy('u.created_at', 'DESC')->get()->getResultArray();